Revit 2024 API
FilteredElementCollector Constructor (Document)
 Constructs a new FilteredElementCollector that will search and filter the set of elements in a document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public FilteredElementCollector(
	Document document
)
Visual Basic
Public Sub New ( _
	document As Document _
)
Visual C++
public:
FilteredElementCollector(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FilteredElementCollector Class
FilteredElementCollector Overload
Autodesk.Revit.DB Namespace